#+TITLE: pyrho's Emacs Conf
#+AUTHOR: pyrho
#+DATE: 2025
#+STARTUP: content indent
#+DESCRIPTION: Modified version of Yay-Evil distro by Ian Y.E. Pan, available at https://github.com/ianyepan/yay-evil-emacs/blob/master/config.org
#+PROPERTY: header-args :tangle yes

My emacs config, currently for Emacs 30.1

** Auto-update UPDATED_AT header
This was causing an issue with org-roam! Because roam expects the first line to be the properties...
Disabling it for now.
#+BEGIN_SRC emacs-lisp
  (defun update-org-updated-at ()
    "Update #+UPDATED_AT header in current org file."
    (when (and (eq major-mode 'org-mode)
               (buffer-file-name))
      (save-excursion
        (goto-char (point-min))
        (if (re-search-forward "^#\\+UPDATED_AT:" nil t)
            (progn
              (beginning-of-line)
              (kill-line)
              (insert (format "#+UPDATED_AT: %s" (format-time-string "%Y-%m-%d %H:%M:%S"))))
          ;; If no UPDATED_AT found, add it after other headers
          (goto-char (point-min))
          (while (looking-at "^#\\+")
            (forward-line))
          (insert (format "#+UPDATED_AT: %s\n" (format-time-string "%Y-%m-%d %H:%M:%S")))))))

  ;; (add-hook 'before-save-hook 'update-org-updated-at)
#+END_SRC

#+RESULTS:
| update-org-updated-at | whitespace-cleanup |
